# Ceci est un titre de niveau 1

Observations

In [24]:
import pandas as pd
import numpy as np

In [31]:
salary = pd.read_csv('./data/data_survey0.csv')
salary.head()

,Year,Hobbyist,ConvertedComp,Country,EdLevel,Employment,JobSat,OrgSize,UndergradMajor,YearsCodePro,Data scientist or machine learning specialist,Database administrator,Data or business analyst,"Engineer, data"
0,2017,"Yes, both",43750.00000,United Kingdom,Bachelor's degree,Employed full-time,4.0,2 to 9 employees,Computer science,2.0,1,1,NaN,NaN
1,2017,"Yes, I program as a hobby",51282.05128,Denmark,Some college/university study without earning ...,Employed part-time,10.0,100 to 499 employees,Computer science,3.0,1,0,NaN,NaN
2,2017,No,25000.00000,Israel,Some college/university study without earning ...,Employed full-time,6.0,"5,000 to 9,999 employees",Computer science,4.0,1,0,NaN,NaN
3,2017,"Yes, I program as a hobby",100000.00000,United States,Some college/university study without earning ...,Employed full-time,5.0,20 to 99 employees,Computer science,15.0,0,1,NaN,NaN
4,2017,"Yes, both",27000.00000,Ukraine,Master's degree,Employed full-time,7.0,100 to 499 employees,Computer science,5.0,0,1,NaN,NaN

In [32]:
salary.shape

(33601, 14)

In [33]:
salary.Country.value_counts()

United States     9098
Germany           2403
United Kingdom    2386
India             2101
Canada            1355
                  ...
Saint Lucia          1
Seychelles           1
Isle of Man          1
Djibouti             1
Chad                 1
Name: Country, Length: 180, dtype: int64

In [34]:
salary.columns

Index(['Year', 'Hobbyist', 'ConvertedComp', 'Country', 'EdLevel', 'Employment',
       'JobSat', 'OrgSize', 'UndergradMajor', 'YearsCodePro',
       'Data scientist or machine learning specialist',
       'Database administrator', 'Data or business analyst', 'Engineer, data'],
      dtype='object')

In [46]:
salary.columns = ['Year', 'Hobbyist', 'Salary (USD,Annual)', 'Country', 'Education Level', 'Employment Status',
       'Job Satisfaction', 'Org Size', 'Primary Field of Study', 'Years of Coding Professionnally',
       'Data scientist or Machine Learning Specialist',
       'DB Administrator', 'Data / Business Analyst', 'Data Engineer']

In [47]:
salary.sample()

,Year,Hobbyist,"Salary (USD,Annual)",Country,Education Level,Employment Status,Job Satisfaction,Org Size,Primary Field of Study,Years of Coding Professionnally,Data scientist or Machine Learning Specialist,DB Administrator,Data / Business Analyst,Data Engineer
29959,2020,Yes,4716.0,Ukraine,Doctoral degree,Employed full-time,4.0,100 to 499 employees,Natural science,NaN,1,0,0.0,0.0

In [76]:
salary = salary.replace(to_replace ="Viet Nam", value ="Vietnam").replace(to_replace ="United Republic of Tanzania", value ="Tanzania").replace(to_replace ="Republic of Korea", value ="South Korea").replace(to_replace ="Slovakia", value ="Slovak Republic").replace(to_replace ="The former Yugoslav Republic of Macedonia", value ="Macedonia").replace(to_replace ="Iran, Islamic Republic of...", value ="Iran").replace(to_replace ="CÃ´te d'Ivoire", value ="Cote d'Ivoire").replace(to_replace ="C√¥te d'Ivoire", value ="Cote d'Ivoire").replace(to_replace ="Venezuela, Bolivarian Republic of...", value ="Venezuela").replace(to_replace ="Congo, Republic of the...", value ="Democratic Republic of the Congo").replace(to_replace ="Bosnia and Herzegovina", value ="Bosnia-Herzegovina")
salary.sort_values(by='Country')['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Argentina',
       'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahamas',
       'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Benin',
       'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia-Herzegovina', 'Botswana',
       'Brazil', 'Brunei Darussalam', 'Bulgaria', 'Burkina Faso',
       'Cambodia', 'Cameroon', 'Canada', 'Chad', 'Chile', 'China',
       'Colombia', 'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba',
       'Cyprus', 'Czech Republic', 'Democratic Republic of the Congo',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Estonia', 'Ethiopia', 'Fiji', 'Finland', 'France',
       'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Guatemala',
       'Guinea', 'Guyana', 'Haiti', 'Honduras', 'Hong Kong',
       'Hong Kong (S.A.R.)', 'Hungary', 'I prefer not to say', 'Iceland',
       'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Isle of Man',
       'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan', 'Kazakhstan',
       'Kenya', 'Kosovo', 'Kuwait', 'Kyrgyzstan',
       "Lao People's Democratic Republic", 'Latvia', 'Lebanon', 'Lesotho',
       'Libyan Arab Jamahiriya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia',
       'Maldives', 'Mali', 'Malta', 'Mauritius', 'Mexico', 'Moldavia',
       'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nepal', 'Netherlands', 'New Caledonia (French)',
       'New Zealand', 'Nicaragua', 'Nigeria', 'Nomadic', 'Norway', 'Oman',
       'Other Country (Not Listed Above)', 'Pakistan', 'Panama',
       'Paraguay', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Qatar', 'Republic of Moldova', 'Romania',
       'Russian Federation', 'Rwanda', 'Saint Lucia',
       'Saint Vincent and the Grenadines', 'Saudi Arabia', 'Senegal',
       'Serbia', 'Seychelles', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'South Korea', 'Spain', 'Sri Lanka',
       'Sudan', 'Suriname', 'Swaziland', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Taiwan', 'Tajikistan', 'Tanzania',
       'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United States', 'Uruguay', 'Uzbekistan', 'Venezuela', 'Vietnam',
       'Virgin Islands (USA)', 'Yemen', 'Zaire', 'Zambia', 'Zimbabwe'],
      dtype=object)